{
  "product_details":{
    "iphone_15":"The iPhone 15, released in September 2023, features a sleek aluminum design with a Ceramic Shield front and color-infused glass back. It comes in five colors: Black, Blue, Green, Yellow, and Pink. The phone measures 2.82 inches in width, 5.81 inches in height, and 0.31 inches in depth, weighing 6.02 ounces.\nThe 6.1-inch Super Retina XDR display offers a resolution of 2556-by-1179 pixels at 460 ppi, with features like Dynamic Island, HDR display, True Tone, Wide color (P3), and Haptic Touch.\nPowered by the A16 Bionic chip, it includes a 6-core CPU, 5-core GPU, and a 16-core Neural Engine. The camera system boasts a 48MP main camera, a 12MP ultra-wide camera, and a 12MP telephoto camera, with various advanced features and video recording capabilities.\nThe 3349 mAh lithium-ion battery ensures all-day battery life. Connectivity options include USB-C, 5G, Wi-Fi 6, and Bluetooth 5.3. Security features include Face ID, Emergency SOS via satellite, and Crash Detection. Storage options are available in 128GB, 256GB, and 512GB, and it runs on iOS 17."
    ,"iphone_14":"The iPhone 14, released in September 2022, features an aluminum design with a Ceramic Shield front and glass back. It is available in six colors: Midnight, Starlight, Blue, Purple, Yellow, and (PRODUCT)RED. The dimensions are 2.82 inches in width, 5.78 inches in height, and 0.31 inches in depth, with a weight of 6.07 ounces.\nThe 6.1-inch Super Retina XDR display has a resolution of 2532-by-1170 pixels at 460 ppi, and includes features like HDR display, True Tone, Wide color (P3), and Haptic Touch.\nPowered by the A15 Bionic chip, it includes a 6-core CPU, 5-core GPU, and a 16-core Neural Engine. The camera system includes a 12MP main camera and a 12MP ultra-wide camera, with advanced features and various video recording options.\nThe 3279 mAh lithium-ion battery provides all-day battery life. Connectivity options include Lightning, 5G, Wi-Fi 6, and Bluetooth 5.3. Security features include Face ID, Emergency SOS via satellite, and Crash Detection. Storage options are available in 128GB, 256GB, and 512GB, and it runs on iOS 16."
    ,"top 10 phone":"iPhone 15 Pro Max (Apple, September 2023): Features a 6.7-inch Super Retina XDR display, A16 Bionic chip, 48MP main camera, USB-C port, and Dynamic Island.\nSamsung Galaxy S24 Ultra (Samsung, February 2024): Comes with a 6.8-inch Dynamic AMOLED display, Exynos 2400/Snapdragon 8 Gen 3, 200MP main camera, S Pen support, and AI capabilities.\nGoogle Pixel 9 Pro (Google, October 2023): Offers a 6.7-inch OLED display, Google Tensor G3 chip, 50MP main camera, AI-powered features, and a stock Android experience.\nGoogle Pixel 8a (Google, May 2024): Includes a 6.1-inch OLED display, Google Tensor G2 chip, 12MP main camera, affordable price, and long battery life.\niPhone 15 (Apple, September 2023): Features a 6.1-inch Super Retina XDR display, A16 Bionic chip, 48MP main camera, USB-C port, and Dynamic Island.\nSamsung Galaxy S24 (Samsung, February 2024): Comes with a 6.1-inch Dynamic AMOLED display, Exynos 2400/Snapdragon 8 Gen 3, 50MP main camera, AI capabilities, and an affordable price.\nOnePlus 12 (OnePlus, January 2024): Offers a 6.7-inch Fluid AMOLED display, Snapdragon 8 Gen 3, 50MP main camera, fast charging, and OxygenOS.\niPhone 15 Pro (Apple, September 2023): Features a 6.1-inch Super Retina XDR display, A16 Bionic chip, 48MP main camera, USB-C port, and Dynamic Island.\nGoogle Pixel 9 (Google, October 2023): Includes a 6.3-inch OLED display, Google Tensor G3 chip, 50MP main camera, AI-powered features, and a stock Android experience.\nOnePlus 12R (OnePlus, March 2024): Comes with a 6.7-inch Fluid AMOLED display, Snapdragon 8 Gen 2, 50MP main camera, fast charging, and OxygenOS.\n"
  }
}